; domain
(define (domain zeno-travel)
(:requirements :typing :negative-preconditions)
(:types aircraft person city flevel - object)
(:predicates (at ?x - person  ?c - city )
             (at_aircraft ?x - aircraft ?c - city)
             (in ?p - person ?a - aircraft)
	         (fuel-level ?a - aircraft ?l - flevel)
	         (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (at ?p ?c)
                 (at_aircraft ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at_aircraft ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))

(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at_aircraft ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at_aircraft ?a ?c1))
              (at_aircraft ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
)

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at_aircraft ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))
)

; problem
(define (problem ZTRAVEL-5-20)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at_aircraft plane1 city6)
	(fuel-level plane1 fl0)
	(at_aircraft plane2 city1)
	(fuel-level plane2 fl0)
	(at_aircraft plane3 city7)
	(fuel-level plane3 fl0)
	(at_aircraft plane4 city8)
	(fuel-level plane4 fl4)
	(at_aircraft plane5 city9)
	(fuel-level plane5 fl1)
	(at person1 city1)
	(at person2 city9)
	(at person3 city4)
	(at person4 city3)
	(at person5 city5)
	(at person6 city6)
	(at person7 city8)
	(at person8 city4)
	(at person9 city4)
	(at person10 city0)
	(at person11 city8)
	(at person12 city0)
	(at person13 city8)
	(at person14 city5)
	(at person15 city2)
	(at person16 city8)
	(at person17 city9)
	(at person18 city9)
	(at person19 city4)
	(at person20 city5)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at_aircraft plane2 city3)
	(at_aircraft plane3 city1)
	(at_aircraft plane5 city6)
	(at person1 city1)
	(at person2 city2)
	(at person3 city8)
	(at person4 city2)
	(at person5 city8)
	(at person6 city6)
	(at person7 city9)
	(at person8 city2)
	(at person9 city6)
	(at person10 city8)
	(at person11 city9)
	(at person12 city9)
	(at person13 city3)
	(at person14 city7)
	(at person15 city2)
	(at person16 city9)
	(at person17 city7)
	(at person18 city2)
	(at person19 city7)
	))

)

; plan
1. (fly plane5 city9 city6 fl1 fl0)
   deleted: (at_aircraft plane5 city9) (fuel-level plane5 fl1)
   added: (at_aircraft plane5 city6) (fuel-level plane5 fl0)
   goals met: 4 of 22
2. (board person7 plane4 city8)
   deleted: (at person7 city8)
   added: (in person7 plane4)
   goals met: 4 of 22
3. (board person16 plane4 city8)
   deleted: (at person16 city8)
   added: (in person16 plane4)
   goals met: 4 of 22
4. (board person13 plane4 city8)
   deleted: (at person13 city8)
   added: (in person13 plane4)
   goals met: 4 of 22
5. (board person11 plane4 city8)
   deleted: (at person11 city8)
   added: (in person11 plane4)
   goals met: 4 of 22
6. (fly plane4 city8 city0 fl4 fl3)
   deleted: (at_aircraft plane4 city8) (fuel-level plane4 fl4)
   added: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   goals met: 4 of 22
7. (board person12 plane4 city0)
   deleted: (at person12 city0)
   added: (in person12 plane4)
   goals met: 4 of 22
8. (board person10 plane4 city0)
   deleted: (at person10 city0)
   added: (in person10 plane4)
   goals met: 4 of 22
9. (fly plane4 city0 city2 fl3 fl2)
   deleted: (at_aircraft plane4 city0) (fuel-level plane4 fl3)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   goals met: 4 of 22
10. (fly plane4 city2 city3 fl2 fl1)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl2)
   added: (at_aircraft plane4 city3) (fuel-level plane4 fl1)
   goals met: 4 of 22
11. (board person4 plane4 city3)
   deleted: (at person4 city3)
   added: (in person4 plane4)
   goals met: 4 of 22
12. (debark person13 plane4 city3)
   deleted: (in person13 plane4)
   added: (at person13 city3)
   goals met: 5 of 22
13. (fly plane4 city3 city2 fl1 fl0)
   deleted: (at_aircraft plane4 city3) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl0)
   goals met: 5 of 22
14. (debark person4 plane4 city2)
   deleted: (in person4 plane4)
   added: (at person4 city2)
   goals met: 6 of 22
15. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 22
16. (fly plane3 city7 city1 fl1 fl0)
   deleted: (at_aircraft plane3 city7) (fuel-level plane3 fl1)
   added: (at_aircraft plane3 city1) (fuel-level plane3 fl0)
   goals met: 7 of 22
17. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 22
18. (fly plane2 city1 city3 fl1 fl0)
   deleted: (at_aircraft plane2 city1) (fuel-level plane2 fl1)
   added: (at_aircraft plane2 city3) (fuel-level plane2 fl0)
   goals met: 8 of 22
19. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 22
20. (fly plane4 city2 city8 fl1 fl0)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city8) (fuel-level plane4 fl0)
   goals met: 8 of 22
21. (debark person10 plane4 city8)
   deleted: (in person10 plane4)
   added: (at person10 city8)
   goals met: 9 of 22
22. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 22
23. (fly plane4 city8 city9 fl1 fl0)
   deleted: (at_aircraft plane4 city8) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city9) (fuel-level plane4 fl0)
   goals met: 9 of 22
24. (debark person7 plane4 city9)
   deleted: (in person7 plane4)
   added: (at person7 city9)
   goals met: 10 of 22
25. (debark person16 plane4 city9)
   deleted: (in person16 plane4)
   added: (at person16 city9)
   goals met: 11 of 22
26. (debark person12 plane4 city9)
   deleted: (in person12 plane4)
   added: (at person12 city9)
   goals met: 12 of 22
27. (debark person11 plane4 city9)
   deleted: (in person11 plane4)
   added: (at person11 city9)
   goals met: 13 of 22
28. (refuel plane4 city9 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 22
29. (board person2 plane4 city9)
   deleted: (at person2 city9)
   added: (in person2 plane4)
   goals met: 13 of 22
30. (board person18 plane4 city9)
   deleted: (at person18 city9)
   added: (in person18 plane4)
   goals met: 13 of 22
31. (board person17 plane4 city9)
   deleted: (at person17 city9)
   added: (in person17 plane4)
   goals met: 13 of 22
32. (fly plane4 city9 city2 fl1 fl0)
   deleted: (at_aircraft plane4 city9) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl0)
   goals met: 13 of 22
33. (refuel plane5 city6 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 13 of 22
34. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 22
35. (debark person2 plane4 city2)
   deleted: (in person2 plane4)
   added: (at person2 city2)
   goals met: 14 of 22
36. (debark person18 plane4 city2)
   deleted: (in person18 plane4)
   added: (at person18 city2)
   goals met: 15 of 22
37. (fly plane4 city2 city4 fl1 fl0)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city4) (fuel-level plane4 fl0)
   goals met: 15 of 22
38. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 22
39. (board person9 plane4 city4)
   deleted: (at person9 city4)
   added: (in person9 plane4)
   goals met: 15 of 22
40. (board person8 plane4 city4)
   deleted: (at person8 city4)
   added: (in person8 plane4)
   goals met: 15 of 22
41. (board person3 plane4 city4)
   deleted: (at person3 city4)
   added: (in person3 plane4)
   goals met: 15 of 22
42. (board person19 plane4 city4)
   deleted: (at person19 city4)
   added: (in person19 plane4)
   goals met: 15 of 22
43. (fly plane4 city4 city5 fl1 fl0)
   deleted: (at_aircraft plane4 city4) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city5) (fuel-level plane4 fl0)
   goals met: 15 of 22
44. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 22
45. (board person5 plane4 city5)
   deleted: (at person5 city5)
   added: (in person5 plane4)
   goals met: 15 of 22
46. (board person14 plane4 city5)
   deleted: (at person14 city5)
   added: (in person14 plane4)
   goals met: 15 of 22
47. (fly plane4 city5 city2 fl1 fl0)
   deleted: (at_aircraft plane4 city5) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city2) (fuel-level plane4 fl0)
   goals met: 15 of 22
48. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 22
49. (debark person8 plane4 city2)
   deleted: (in person8 plane4)
   added: (at person8 city2)
   goals met: 16 of 22
50. (fly plane4 city2 city6 fl1 fl0)
   deleted: (at_aircraft plane4 city2) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city6) (fuel-level plane4 fl0)
   goals met: 16 of 22
51. (debark person9 plane4 city6)
   deleted: (in person9 plane4)
   added: (at person9 city6)
   goals met: 17 of 22
52. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 17 of 22
53. (fly plane4 city6 city7 fl1 fl0)
   deleted: (at_aircraft plane4 city6) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city7) (fuel-level plane4 fl0)
   goals met: 17 of 22
54. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 17 of 22
55. (debark person19 plane4 city7)
   deleted: (in person19 plane4)
   added: (at person19 city7)
   goals met: 18 of 22
56. (debark person17 plane4 city7)
   deleted: (in person17 plane4)
   added: (at person17 city7)
   goals met: 19 of 22
57. (debark person14 plane4 city7)
   deleted: (in person14 plane4)
   added: (at person14 city7)
   goals met: 20 of 22
58. (fly plane4 city7 city8 fl1 fl0)
   deleted: (at_aircraft plane4 city7) (fuel-level plane4 fl1)
   added: (at_aircraft plane4 city8) (fuel-level plane4 fl0)
   goals met: 20 of 22
59. (debark person5 plane4 city8)
   deleted: (in person5 plane4)
   added: (at person5 city8)
   goals met: 21 of 22
60. (debark person3 plane4 city8)
   deleted: (in person3 plane4)
   added: (at person3 city8)
   goals met: 22 of 22
